app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "nome", "tipo", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 28 May 2014 21:34:02 UTC +00:00], ["nome", "Stipendio"], ["tipo", true], ["updated_at", Wed, 28 May 2014 21:34:02 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save