app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all

SELECT SUM("logs"."valore") AS sum_valore, categories.nome AS categories_nome FROM "logs" LEFT OUTER JOIN "categories" ON "categories"."id" = "logs"."category_id" WHERE (categories.tipo = 't') GROUP BY categories.nome
---
  def entrate
    t = 'Entrate'
    @entrate = Log.includes(:category).where('categories.tipo = ?', true).group("categories.nome").sum(:valore)

SELECT SUM("logs"."valore") AS sum_valore, categories.nome AS categories_nome FROM "logs" LEFT OUTER JOIN "categories" ON "categories"."id" = "logs"."category_id" WHERE (NOT categories.tipo = 't') GROUP BY categories.nome
---
  def uscite
    t = 'Uscite'
    @uscite = Log.includes(:category).where('NOT categories.tipo = ?', true).group("categories.nome").sum(:valore)

INSERT INTO "logs" ("category_id", "created_at", "note", "updated_at", "valore") VALUES (?, ?, ?, ?, ?)  [["category_id", 3], ["created_at", Wed, 28 May 2014 21:39:16 UTC +00:00], ["note", ""], ["updated_at", Wed, 28 May 2014 21:39:16 UTC +00:00], ["valore", 100]]
---
  def create
    @log = Log.new(log_params)

    respond_to do |format|
      if @log.save

DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 1]]
---
  def destroy
    @log.destroy

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "4"]]
---
    def set_log
      @log = Log.find(params[:id])