app/views/logs/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="controls">
      <%= f.collection_select :category_id, Category.all, :id, :nome, prompt: false %>